GabrielPCamargo/nke_esp32c3/src/NKE.c
    char type = 'd';
    if (strchr(format, '%')) {
      char *percent = strchr(format, '%');
      switch (*(percent + 1)) {
        case 'd': type = 'd'; break;
        case 'f': type = 'f'; break;
        case 'c': type = 'c'; break;
        case 's': type = 's'; break;
        case '%': type = '%'; break;
      }
    }

    nkprintQueue[nkprintQueueTail].format = format;
    nkprintQueue[nkprintQueueTail].type = type;

    switch (type) {
      case 'd':
        if (var != NULL)
            nkprintQueue[nkprintQueueTail].var.i = *(int *)var;
        else
            nkprintQueue[nkprintQueueTail].var.i = 0;
        break;
      case 'f':
        nkprintQueue[nkprintQueueTail].var.f = *(float *)var;
        break;
      case 'c':
        nkprintQueue[nkprintQueueTail].var.c = *(char *)var;
        break;
      case 's':
        nkprintQueue[nkprintQueueTail].var.s = (const char *)var;
        break;
      default:
        break;
    }

    nkprintQueueTail = (nkprintQueueTail + 1) % MAX_NKPRINT_QUEUE;
    printTailMutex = false; // Libera o printTailMutex
}

NkPrintQueueEntry dequeueNkPrint() {
    while(printHeadMutex == true); // Espera se printHeadMutex estiver ocupado
    printHeadMutex = true; // Bloqueia o printHeadMutex
    NkPrintQueueEntry entry = nkprintQueue[nkprintQueueHead];
    nkprintQueueHead = (nkprintQueueHead + 1) % MAX_NKPRINT_QUEUE;
    printHeadMutex = false; // Libera o printHeadMutex
    return entry;
}

void sys_nkprint(const char *format, void *var) {
  // Adicionar a mensagem na fila de escrita
  enqueueNkPrint(Descriptors[TaskRunning].Tid, format, var);
  //switchTask();
}

void print_float_custom(float valor, int precisao) {
    // 1. Lida com números negativos
    if (valor < 0.0) {
        printf("-");
        valor = -valor;
    }

    // 2. Aplica arredondamento básico com base na precisão
    float arredondamento = 0.5;
    for (int i = 0; i < precisao; ++i) {
        arredondamento /= 10.0;
    }
    valor += arredondamento;

    // 3. Extrai a parte inteira
    int parte_inteira = (int)valor;
    
    // 4. Extrai a parte fracionária
    float parte_fracionaria = valor - (float)parte_inteira;

    // 5. Imprime a parte inteira
    printf("%d", parte_inteira);

    // 6. Imprime a parte fracionária dígito por dígito
    if (precisao > 0) {
        printf(".");
        for (int i = 0; i < precisao; i++) {
            parte_fracionaria *= 10.0;
            int digito = (int)parte_fracionaria;
            printf("%d", digito);
            parte_fracionaria -= (float)digito;
        }
    }
}

void serial_print(const char *fmt, NkPrintQueueEntry entry)
{
  float *auxfloat;
    switch(entry.type)
    {
        case 'd':
            printf(fmt, entry.var.i);
            break;

        case 'c':
            printf(fmt, entry.var.c);
            break;

        //Sem suporte para soft float com esse toolchain.
        case 'f':
            auxfloat = (float *)&entry.var.f;
            
            // Percorre a string de formatação caractere por caractere
            for (const char *p = fmt; *p != '\0'; p++) {
                
                if (*p == '%') {
                    const char *temp = p + 1;
                    
                    // Ignora possíveis modificadores (ex: %.2f, %04f, %.*f)
                    // para garantir que pegamos o 'f' corretamente
                    while (*temp == '.' || *temp == '*' || (*temp >= '0' && *temp <= '9')) {
                        temp++;
                    }
                    
                    if (*temp == 'f') {
                        // Chegou no 'f'! Imprime o float usando sua função
                        print_float_custom(*auxfloat, calcularPrecisao(*auxfloat));
                        
                        p = temp; // Avança o ponteiro principal para pular o 'f'
                        continue; // Vai para a próxima iteração do laço
                    }
                }
                
                // Se não for o '%f', imprime o caractere normal (texto antes e depois)
                printf("%c", *p);
            }
            break;

        case 's':
            printf(fmt, entry.var.s);
            break;

        case '%':
            printf(fmt);
            break;

        default:
            printf("Formato invalido");
            break;
    }
}

void processPrintQueue() {
  while (printTailMutex);
  printTailMutex = true;
  int snapshotTail = nkprintQueueTail;
  printTailMutex = false;

  while (nkprintQueueHead != snapshotTail) {
    NkPrintQueueEntry entry = dequeueNkPrint();
    serial_print((char *)entry.format, entry);
  }
}


void sys_taskexit(void)
{
  Descriptors[TaskRunning].State=BLOCKED;
  switchTask();
}
void enqueueNkRead(int tid, const char *format, void *var) {
    nkreadQueue[nkreadQueueTail].tid = tid;
    nkreadQueue[nkreadQueueTail].format = format;
    nkreadQueue[nkreadQueueTail].var = var;
    nkreadQueueTail = (nkreadQueueTail + 1) % MAX_NKREAD_QUEUE;
}

NkReadQueueEntry dequeueNkRead() {
    NkReadQueueEntry entry = nkreadQueue[nkreadQueueHead];
    nkreadQueueHead = (nkreadQueueHead + 1) % MAX_NKREAD_QUEUE;
    return entry;
}

void sys_nkread(const char *format, void *var) {
  // Adicionar a thread atual na fila de leitura
  enqueueNkRead(Descriptors[TaskRunning].Tid, format, var);
  // Bloquear a thread atual
  Descriptors[TaskRunning].State = BLOCKED;
  switchTask();
}

float stringToFloat(const char* str) {
    float result = 0.0;
    float factor = 1.0;

    if (*str == '-') {
        str++;
        factor = -1.0;
    }

    // Parte inteira
    for (; *str >= '0' && *str <= '9'; str++) {
        result = result * 10.0 + (*str - '0');
    }

    // Parte fracion?ria
    if (*str == '.') {
        float fraction = 0.1;
        str++;
        for (; *str >= '0' && *str <= '9'; str++) {
            result += (*str - '0') * fraction;
            fraction *= 0.1;
        }
    }

    return result * factor;
}

int stringToInt(const char* str) {
    int result = 0;
    int sign = 1;

    // Ignora possíveis espaços em branco no início
    while (*str == ' ' || *str == '\n' || *str == '\r') {
        str++;
    }

    // Verifica sinal negativo
    if (*str == '-') {
        sign = -1;
        str++;
    }

    // Converte os caracteres numéricos
    for (; *str >= '0' && *str <= '9'; str++) {
        result = result * 10 + (*str - '0');
    }

    return result * sign;
}

void serialEvent() {
    while (UART_USB_AVAIL & 0X4) {
        char c = UART_USB_EP1_DATA;
        if (c == '\n') {
            serialInputBuffer[serialInputIndex] = '\0';  // Termina a string
            serialInputIndex = 0;  // Reinicia o ?ndice

