GabrielPCamargo/nke_esp32c3/src/NKE.c
            // Desbloquear a thread que esta esperando por entrada
            if (nkreadQueueHead != nkreadQueueTail) {
                NkReadQueueEntry entry = dequeueNkRead();
                 if (strcmp(entry.format, "%f") == 0) {
                    // Para float, usar nossa fun??o auxiliar
                   *(float *)(entry.var) = stringToFloat(serialInputBuffer);
                } else if (strcmp(entry.format, "%c") == 0) {
                    *(char *)entry.var = serialInputBuffer[0];
                }
                else if (strcmp(entry.format, "%s") == 0) {
                    strcpy(entry.var, serialInputBuffer);
                }
                else if (strcmp(entry.format, "%d") == 0) {
                    *(int *)entry.var = stringToInt(serialInputBuffer);
                }
                else if (strcmp(entry.format, "%u") == 0) {
                    *(unsigned *)entry.var = stringToInt(serialInputBuffer);
                }
                Descriptors[entry.tid].State = READY;
            }
        } else {
            if (serialInputIndex < 127) {
                serialInputBuffer[serialInputIndex++] = c;
            }
        }
    }
}


/*************************************************************
*                                                            *
* Chamadas de Sistema a N vel de usu rio                     *
*           User Call                                        *
*                                                            *
*************************************************************/

void taskcreate(int *ID,void (*funcao)(), uint8_t period, uint8_t wcet) //parametros armazenados em R0 e R1 na chamada
{
  Parameters arg;
  printf("taskcreate called with funcao=%p, period=%d, wcet=%d\n", funcao, period, wcet); // Debug
  arg.CallNumber=TASKCREATE;
  arg.p0=(unsigned char *)ID;
  arg.p1=(unsigned char *)funcao;
  arg.p2=(unsigned char *)(uint16_t)period;
  arg.p3=(unsigned char *)(uint16_t)wcet;
  callsvc(&arg);
}
void start(int scheduler)
{
  Parameters arg;
  arg.CallNumber=START;
  arg.p0=(unsigned char *)scheduler;
  callsvc(&arg);
}
void semwait(sem_t *semaforo)
{
  Parameters arg;
  arg.CallNumber=SEM_WAIT;
  arg.p0=(unsigned char *)semaforo;
  callsvc(&arg);
}

void sempost(sem_t *semaforo)
{
  Parameters arg;
  arg.CallNumber=SEM_POST;
  arg.p0=(unsigned char *)semaforo;
  callsvc(&arg);
}

void seminit(sem_t *semaforo, int ValorInicial)
{
  Parameters arg;
  arg.CallNumber=SEM_INIT;
  arg.p0=(unsigned char *)semaforo;
  arg.p1=(unsigned char *)ValorInicial;
  callsvc(&arg);
}
void setmyname(const char *name)
{
  Parameters arg;
  arg.CallNumber=SETMYNAME;
  arg.p0=(unsigned char *)name;
  callsvc(&arg);
}
void getmynumber(int *number)
{
  Parameters arg;
  arg.CallNumber=GETMYNUMBER;
  arg.p0=(unsigned char *)number;
  callsvc(&arg);
}
void getmyname(const char *name)
{
  Parameters arg;
  arg.CallNumber=GETMYNAME;
  arg.p0=(unsigned char *)name;
  callsvc(&arg);
}
void sleep(int time)
{
  Parameters arg;
  arg.CallNumber=SLEEP;
  arg.p0=(unsigned char *)time;
  callsvc(&arg);
}
void msleep(int time)
{  
  Parameters arg;
  arg.CallNumber=SLEEP;
  arg.CallNumber=MSLEEP;
  arg.p0=(unsigned char *)time;
  callsvc(&arg);
}

void usleep(int time)
{
  Parameters arg;
  arg.CallNumber=USLEEP;
  arg.p0=(unsigned char *)time;
  callsvc(&arg);
}
void rmssleep(void)
{
  Parameters arg;
  arg.CallNumber=RMSSLEEP;
  callsvc(&arg);
}
void taskexit(void)
{
  Parameters arg;
  arg.CallNumber=EXITTASK;
  callsvc(&arg);
}

void ligaled(void)
{
  Parameters arg;
  arg.CallNumber=LIGALED;
  callsvc(&arg);
}

void desligaled(void)
{
  Parameters arg;
  arg.CallNumber=DESLIGALED;
  callsvc(&arg);
}

void nkprint(char *fmt,void *number)
{
  Parameters arg;
  arg.CallNumber=NKPRINT;
  arg.p0=(unsigned char *)fmt;
  arg.p1=(unsigned char *)number;
  callsvc(&arg);
}
void nkread(const char *format, void *var) {
    Parameters arg;
    arg.CallNumber = NKREAD;
    arg.p0 = (unsigned char *)format;
    arg.p1 = (unsigned char *)var;
    callsvc(&arg);
}
/*************************************************************
*                                                            *
*                   Programa do  usu rio                     *
*                       - Aplica  o -                        *
*                                                            *
*************************************************************/


volatile int16_t tid0, tid1, tid2, tid3, tid4;
int i, j ;
//sem_t s0;
//sem_t s1;
//sem_t s2;
//sem_t s3;

void p0() {
  printf("'p3' (Read Test) started\n");
  static int my_tid;
  getmynumber(&my_tid);

  int valor_inteiro = 0;
  float valor_float = 0.0;
  char buffer_texto[30] = "";

  while (1) {
    nkprint("\n--- Teste de Entrada (nkread) ---\n", 0);
    
    // 1. Lendo um Inteiro
    nkprint("Digite um numero inteiro: ", 0);
    nkread("%d", &valor_inteiro); // A task bloqueia aqui ate o \n chegar na serial
    nkprint("Inteiro lido: %d\n", &valor_inteiro);

    // 2. Lendo um Float
    nkprint("Digite um numero float (ex: 3.14): ", 0);
    nkread("%f", &valor_float);
    nkprint("Float lido: %f\n", &valor_float);

    // 3. Lendo uma String
    nkprint("Digite uma palavra: ", 0);
    nkread("%s", buffer_texto);
    nkprint("String lida: %s\n", buffer_texto);

    nkprint("---------------------------------\n", 0);
    
    // Pausa para não poluir a tela imediatamente caso caia em algum loop
    sleep(2); 
  }
}

void p1() {
  printf("'p1' started with TID: %d\n", 1);
  static int number1;
  getmynumber(&number1);
  while (1) {
    //printReadyList();

  }
}

void p2() {
  printf("'p2' started with TID: %d\n", 2);
  static int number2;
  getmynumber(&number2);
  while (1) {
    //printReadyList();
  }
}

/*************************************************************
*                                                            *
*               Setup e criar Tasks                    *
*                                                            *
*                                                            *
*************************************************************/

int main(void) {
    // Desabilita o Watchdog para evitar resets inesperados durante o desenvolvimento
    wdt_disable(); 
    
    //Configura o vetor de interrupção.
    __asm__ volatile ("csrw mtvec, %0" :: "r"((uintptr_t)vector_table)); 

    // Habilita interrupções globalmente (MIE=1)
    // Não é necessário pois cada tarefa tem seu próprio mstatus com MIE=1
    //__asm__ volatile ("csrsi mstatus, 0x8"); 
    

    // Verificar número das interrupções, talvez seja melhor trocar os defines para esse código.        
    nkprint("FakeOS \n", 0) ;
    nkprint("Versao 0.0 \n", 0) ;
    
    //seminit(&s0, 1);
    //seminit(&s1, 0);
    //seminit(&s2, 0);
    //seminit(&s3, 0);
    
    taskcreate(&tid0,idle,100, 50);
    taskcreate(&tid1,p0,10, 2);
    taskcreate(&tid2,p1,20, 5);
    taskcreate(&tid3,p2,30, 8);
    // taskcreate(&tid3,p3,1);

    start (RR) ;
    
    systimer_init();

    startOS(Descriptors[0].P); //coloca a task idle para rodar (não vai executar até a interrupção, vai ficar no while (1))

    // O código do main() não deve rodar nada, pois a task idle() já deve começar a executar.
    printf("Erro: main() foi executado! Isso não deveria acontecer.\n");
    while(1); 
}